server/app/controllers/bucketlists_controller.rb

SELECT "bucketlists".* FROM "bucketlists"
SELECT "items".* FROM "items"
---
	def index
		@bucketlists = Bucketlist.all
		@items = Item.all